# parameters
nc: 7  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  #- [30,61, 62,45, 59,119]  # P4/16
  #- [116,90, 156,198, 373,326]  # P5/32
  - [3,6,  7,10,  11,22]
  - [23,34,  38,77,  98,119]

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, BottleneckCSP, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, BottleneckCSP, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, BottleneckCSP, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, BottleneckCSP, [1024, False]],  # 9
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],                                 #H1
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],                 #H2
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4               #H3
   [-1, 3, BottleneckCSP, [512, False]],  # 13                 #H4

   [-1, 1, Conv, [256, 1, 1]],                                 #H5
   #[-1, 1, nn.Upsample, [None, 2, 'nearest']],                 #H6
   #[[-1, 4], 1, Concat, [1]],  # cat backbone P3               #H7
   #[-1, 3, BottleneckCSP, [256, False]],  # 17 (P3/8-small)    #H8

   #[-1, 1, Conv, [256, 3, 2]],                                 #H9
   #[[-1, 14], 1, Concat, [1]],  # cat head P4                  #H10
   [-1, 3, BottleneckCSP, [512, False]],  # 20 (P4/16-medium)  #H11

   [-1, 1, Conv, [512, 3, 2]],                                 #H12
   [[-1, 10], 1, Concat, [1]],  # cat head P5                  #H13
   [-1, 3, BottleneckCSP, [1024, False]],  # 23 (P5/32-large)  #H14

   #[[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)    #H5
   [[15, 18], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)    #H5
  ]
